In [1]:
import psycopg2

In [2]:
host = 'xxxxxx.yyyyyyyyyyy.zzzzzzzz.rds.amazonaws.com'
dbname = 'testDB'
user = 'abcdefgh'
pas = 'pqrstuv'

In [3]:
conn_string = f'postgres://{user}:{pas}@{host}/{dbname}'
conn_string

'postgres://abcdefgh:pqrstuv@xxxxxx.yyyyyyyyyyy.zzzzzzzz.amazonaws.com/testDB'

In [4]:
conn = psycopg2.connect(dbname=dbname,
                        password=pas,
                        host=host,
                        user=user,
                        port=5432
                        )
cur = conn.cursor()

In [6]:
conn.autocommit = True

In [7]:
import os
os.chdir("./data")

In [8]:
import pandas as pd
acc = pd.read_csv('accounts.csv')
acc.head()

,customer_id,first_name,last_name,address_1,address_2,city,state,zip_code,join_date
0,4321,john,doe,1532 East Main St.,PO BOX 5,Middleton,Ohio,50045,2022/01/16
1,5677,jane,doe,543 Oak Rd.,NaN,BigTown,Iowa,84432,2021/05/07

In [9]:
acc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  2 non-null      int64
 1    first_name  2 non-null      object
 2    last_name   2 non-null      object
 3    address_1   2 non-null      object
 4    address_2   1 non-null      object
 5    city        2 non-null      object
 6    state       2 non-null      object
 7    zip_code    2 non-null      int64
 8    join_date   2 non-null      object
dtypes: int64(2), object(7)
memory usage: 272.0+ bytes

In [10]:
products = pd.read_csv('products.csv')
products

   product_id   product_code  product_description
0         345              1        Widget Medium
1         241              2         Widget Large

In [11]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   product_id            2 non-null      int64
 1    product_code         2 non-null      int64
 2    product_description  2 non-null      object
dtypes: int64(2), object(1)
memory usage: 176.0+ bytes

In [12]:
transactions = pd.read_csv('transactions.csv')
transactions

,transaction_id,transaction_date,product_id,product_code,product_description,quantity,account_id
0,AS345-ASDF-31234-FDAAD-9345,2022/06/01,345,1,Widget Medium,5,4321
1,9234A-JFDA-87654-BFAEA-0932,2022/06/02,241,2,Widget Large,1,5677

In [13]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   transaction_id        2 non-null      object
 1    transaction_date     2 non-null      object
 2    product_id           2 non-null      int64
 3    product_code         2 non-null      int64
 4    product_description  2 non-null      object
 5    quantity             2 non-null      int64
 6    account_id           2 non-null      int64
dtypes: int64(4), object(3)
memory usage: 240.0+ bytes

In [14]:
cur.execute("DROP TABLE IF EXISTS accounts CASCADE;")
cur.execute("DROP TABLE IF EXISTS products CASCADE;")
cur.execute("DROP TABLE IF EXISTS transactions CASCADE;")

In [15]:
# account table
cur.execute("""CREATE TABLE accounts(
           customer_id integer PRIMARY KEY,
           first_name varchar,
           last_name varchar,
           address_1 varchar,
           address_2 varchar,
           city varchar,
           state varchar,
           zip_code integer,
           join_date date
           );
           """)

In [16]:
# product table
cur.execute("""CREATE TABLE products(
           product_id integer PRIMARY KEY,
           product_code integer,
           product_description varchar
           );
           """)

In [17]:
# transaction table
cur.execute("""CREATE TABLE transactions(
           transaction_id varchar PRIMARY KEY
           ,transaction_date date
           ,product_id integer REFERENCES products(product_id)
           ,product_code integer
           ,product_description varchar
           ,quantity integer
           ,account_id integer REFERENCES accounts(customer_id)
           );
           """)

In [24]:
import psycopg2.extras as extras

def execute_values(conn, df, table):
    tuples = [tuple(x) for x in df.to_numpy()]  
    cols = ','.join(list(df.columns))
    # SQL query to execute
    query = "INSERT INTO %s(%s) VALUES %%s" % (table, cols)
    cursor = conn.cursor()
    try:
        extras.execute_values(cursor, query, tuples)
        conn.commit()
    except (Exception, psycopg2.DatabaseError) as error:
        print("Error: %s" % error)
        conn.rollback()
        cursor.close()
        return 1
    print("the dataframe is inserted")
    cursor.close()

In [25]:
execute_values(conn, acc, 'accounts')

the dataframe is inserted

In [26]:
execute_values(conn, products, 'products')

the dataframe is inserted

In [27]:
execute_values(conn, transactions, 'transactions')

the dataframe is inserted

In [ ]:
conn.close()